OpenFOAM/OpenFOAM-2.2.x/tutorials/lagrangian/reactingParcelFilmFoam/rivuletPanel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       85980;
    }
    outlet
    {
        type            patch;
        nFaces          180;
        startFace       86100;
    }
    sides
    {
        type            patch;
        nFaces          43740;
        startFace       86280;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        nFaces          43200;
        startFace       130020;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
43200
(
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 -1.110223025e-16 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 -1.110223025e-16 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -2.220446049e-16)
...
)
;
    }
)

// ************************************************************************* //
